Autodesk.Revit.DB.Mechanical.DuctLiningType.IsValidRoughness(System.Double)
Identifies if the input roughness is valid.
Remarks:
Roughness should be at least equal to or larger than 0.
roughness:
The roughness to check.
Returns:
True if the value is acceptable, false otherwise.
Since:
2012

Autodesk.Revit.DB.Mechanical.DuctLiningType.Roughness
The roughness of Duct Lining.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The roughness value should be at least equal to or larger than 0.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2012

Autodesk.Revit.DB.Mechanical.DuctLiningType
This class represents a duct lining type in Autodesk Revit.
Since:
2012